Repository: Soroosh/BadiCalendar
Catalog: lib/l10n/app_*.arb
Languages: de, es, fa, fr, tr

# appName
source: Bahá’í Calendar
de: Bahá’í Kalender
es: Calendario Bahá’í
fa: تقویم بهایی
fr: Calendrier Badīʿ
tr: Bahai Takvimi

# dayDifference
source: {count, plural, =0{Today} =1{Tomorrow} other{In {count} days}}
de: {count, plural, =0{Heute}, =1{Morgen}, other{In {count} Tagen}}
es: {count, plural, =0{Hoy} =1{Mañana} other{En {count} días}}
fa: {count, plural, =0{امروز}, =1{در یک روز}, other{ در {count} روز }}
fr: {count, plural, =0{Aujourd'hui }, =1{Dans un jour}, other{Dans {count} jours}}
tr: {count, plural, =0{Bugün}, =1{Bir günde}, other{{count} gün sonra}}

# begin
source: From {begin}
de: Vom {begin}
es: De {begin}
fa: از {begin}
fr: De {begin}
tr: Nereden {begin}

# end
source: Till {end}
de: Bis {end}
es: Hasta {end}
fa: تا {end}
fr: Jusque {end}
tr: Kadar {end}

# settingsTitle
source: Settings
de: Einstellungen
es: Configuración
fa: تنظیم
fr: Paramètres
tr: Ayarlar

# hideSunsetInDates
source: Hide sunset times
de: Sonnenuntergangszeiten nicht anzeigen
es: Ocultar la hora de la puesta de sol

source: Date format
de: Datumsformat
es: Formato de fecha
fa: قالب
fr: Format de date
tr: Biçim

# dateFormatFromIndex
source: {count, plural, =0{year-month-day} =1{day.month.year} =2{month/day/year} other{{count} not set}}
de: {count, plural, =0{Jahr-Monat-Tag} =1{Tag.Monat.Jahr} =2{Monat/Tag/Jahr} other{{count} not set}}
es: {count, plural, =0{aaa-mm-dd} =1{dd.mm.aaa} =2{mm/dd/aaa} other{{count} not set}}
fa: {count, plural, =0{سال-ماه-روز} =1{روز.ماه.سال} =2{ماه/روز/سال} other{{count} not set}}
fr: {count, plural, =0{an-mois-journée} =1{journée.mois.an} =2{mois/journée/an} other{{count} not set}}
tr: {count, plural, =0{yıl-ay-gün} =1{gün.ay.yıl} =2{ay/gün/yıl} other{{count} not set}}

# locationSettingsTitle
source: Location Method
de: Positionierungsmethode
es: método de localización
fa: موقعیت
fr: Méthode de localisation
tr: Konum Yöntemi

# locationSettingsMethod
source: {index, plural, =0{Auto locate} =1{Manually set location} other{Do not use location}}
de: {index, plural, =0{Geräteposition}, =1{Manuell setzten}, =other{Position nicht verwenden}}
es: {index, plural, =0{localización automática} =1{localización manual} other{No usar localización}}
fa: {index, plural, =0{مکان یابی خودکار}, =1{مکان را به صورت دستی تنظیم کنید}, =other{از مکان استفاده نکنید}}
fr: {index, plural, =0{Localisation automatique}, =1{Emplacement défini manuellement}, =other{N'utilisez pas la localisation}}
tr: {index, plural, =0{Otomatik bul}, =1{Manuel olarak konum ayarla}, =other{Konumu kullanma}}

source: Longitude
de: Längengrad
es: Longitud
fa: عرض جغرافیایی
tr: Boylam

# longitudeHelper
source: Decimal value. Negative values for West.
de: Dezimalzahl - Negativer Wert für West.
es: Cifra decimal. Cifras negativas para Oeste.
fa: ارزشهای منفی برای غرب
fr: Valeurs négatives pour l'Ouest.
tr: Batı için negatif değerler.

source: Latitude
de: Breitengrad
fa: عرض جغرافیایی
tr: Enlem

# latitudeHelper
source: Decimal value. Negative values for South.
de: Dezimalzahl - Negativer Wert für Süd.
es: Cifra decimal. Cifraas negativas para el Sur.
fa: مقادیر منفی برای جنوب.
fr: Valeurs négatives pour le Sud.
tr: Güney için negatif değerler.

# locationError
source: Value is erroneous. Please change.
de: Eintrag ist fehlerhaft. Bitte ändern.
es: Cifrs errónea. Por favor, verifique.
fa: ارزش اشتباه است. لطفا عوض کنید
fr: La valeur est erronée. S'il vous plaît changer.
tr: Değer hatalı. Lütfen değiştir.

# languageSettingsTitle
source: Language
de: Sprache
es: Idioma
fa: زبان
fr: Langue
tr: Dil

source: Feasts
de: 19-Tage-Feste
es: Fiestas
fa: ضیافت
fr: Fêtes
tr: Ziyafetler

# holyDayTab
source: Holy Days
de: Feiertage
es: Días Sagrados
fa: ایام متبرکه
fr: Jours fériés
tr: Kutsal Günler

# upcoming
source: Upcoming Holy and special days
de: Die nächsten Feiertage und besondere Tage
es: Los próximos Días Sagrados y días especiales
fa: روزهای مقدس و خاص آینده
fr: Prochains jours saints et spéciaux
tr: Yaklaşan kutsal ve özel günler

# fullDate
source: Date
de: Datum
es: Fecha
fa: تاریخ
fr: Date Badí‘
tr: Tam Tarih

source: CANCEL
de: ABBRECHEN
es: CANCELAR
fa: لغو
fr: ANNULER
tr: iptal

source: Select a date
de: Datum auswählen
es: Selecciona una fecha
fa: تاریخ را انتخاب کنید
fr: Sélectionnez une date
tr: Bir tarih seçin

# specialDay
source: Holy and special day:
de: Feiertage und besondere Tage:
es: Día Sagrado ó día especial:
fa: روز مقدس و ویژه:
fr: Jour fériés et spécial:
tr: Kutsal ve özel gün:

source: Period of fast
de: Fastenzeit
es: Período de ayuno
fa: ایام روزه
fr: Période de jeûne
tr: Oruç dönemi

# sunset
source: Sunset at {time}
de: Sonnenuntergang um {time}
es: Puesta de sol {time}
fa: غروب {time}
fr: Coucher de soleil à {time}
tr: Gün batımı {time}

# sunrise
source: Sunrise at {time}
de: Sonnenaufgang um {time}
es: Salida de sol {time}
fa: طلوع آفتاب در {time}
fr: Lever du soleil à {time}
tr: Gün doğumu {time}

# noon
source: Noon at {time}
de: Mittag um {time}
es: Mediodía {time}

# dayAndMonth
source: The name of the day is {day} of the month {month}
de: Der Name des Tages ist {day} im Monat {month}
es: El nombre del día es {day} del mes {month}
fa: نام روز {day} ماه {month}
fr: Le nom du jour est {day} du mois {month}
tr: Günün adı {day} ayın {month}

# dayAndMonthTitle
source: Month and Day name:
de: Monats- und Tagesname:
es: Nomnre del mes y del día:
fa: نام ماه و روز:
fr: Nom du mois et du jour:
tr: Ay ve Gün adı:

# dayAndMonthExplanation
source: Each of the 19 days of a month has a name. The names are the same as the month names- the first day of the month is the day Bahá and the last day of the month is the day ‘Alá’.
de: Jedes der 19 Tage eines Monats hat einen Namen. Die Namen sind dieselben wie die Monatsnamen - der erste Tag des Monats ist der Tag Bahá und der letzte Tag des Monats ist der Tag ‘Alá’.
es: Cada uno de los 19 días de un mes tiene un nombre. Los día del mes tienen los mismos nombres que los meses del año.- El primer día del mes es el día Bahá y el último día del mes es el día ‘Alá’.
fa: هر ۱۹ روز یک ماه یک نام دارد. نام ها همان نام ماه ها هستند - اولین روز ماه ، روز بها و آخرین روز ماه ، روز علاء است

# feastHint
source: It's the first day of the month. This is a feast day.
de: Es ist der erste Tag des Monats. Es ist ein 19-Tagefest Tag.
es: Este es el primer dá del mes. Es un día de fiesta de 19 días.
fa: روز اول ماه است. این روز ضیافت است.
fr: Le premier jour des mois. C'est un jour de fête.
tr: Ayın ilk günü. Bu bir bayram günü.

# dayOfTheWeek
source: The day of the week is {day}.
de: Der Wochentag ist {day}.
es: El día de la semana es {day}.
fa: روز هفته {day}.
fr: Le jour de la semaine est {day}.
tr: Haftanın günü {day}.

# weekDayTitle
source: Weekday:
de: Wochentag:
es: Día de la semana:
fa: روز هفته
fr: Jour de la semaine:
tr: Hafta içi:

# vahidTitle
source: Year, Vahid, and Kull-i-Shay:
de: Jahr, Vahid, und Kull-i-Shay:
es: Año, Vahid, and Kull-i-Shay:
fa: سال, واحد, و كل شيء:
fr: An, Wāḥid et Kull-i Šay:
tr: Yıl, Vahid, ve Külli-Şey:

# vahidExplanation
source: The Badí‘ Calendar defines Váḥid which is a period of 19 years. Each year in the Váḥid has a name. 19 Váḥids (361 years) are a Kull-i-Shay’.
de: Der Badí‘ Kalender hat die Zeiteinheit Váḥid, welches eine Periode von 19 Jahren ist. Jedes Jahr in einem Váḥid hat einen Namen. 19 Váḥids (361 Jahre) sind ein Kull-i-Shay’.
es: El calendario Badí‘ Calendar define un Váḥid como un período de 19 años. Cada año en el Váḥid tiene un nombre. 19 Váḥids (361 años) forman un Kull-i-Shay’.
fa: تقویم بهایی واحد را تعریف می کند که یک دوره ۱۹ ساله است. هر سال در واحد یک نام دارد. ۱۹ واحد (۳۶۱ سال) یک کل شی است.

# vahid
source: The year {year} in the Badi calendar is the year {yearInVahid} in the Váḥid {vahid} of the 1st Kull-i-Shay and has the name {yearName}.
de: Das Jahr {year} im Badi Kalender ist das Jahr {yearInVahid} im Váḥid {vahid} des ersten Kull-i-Shay und hat den Namen {yearName}.
es: El año {year} en el calendario badí {yearInVahid} en el Váḥid {vahid} del primer Kull-i-Shay y se llama {yearName}.
fa: سال {year} در تقویم بهایی سال {yearInVahid} در واحد {vahid} اول کال شی است و نام آن سال {yearName} است

source: SKIP
de: ABBRECHEN
es: OMITIR
fa: پرش
fr: SAUTER
tr: ATLA

source: NEXT
de: WEITER
es: SIGUIENTE
fa: بعد
fr: PROCHAIN
tr: SONRAKİ

# fin
source: FINISH
de: FERTIG
es: FINALIZAR
fa: تمام
fr: FIN
tr: BİTİŞ

# selectLanguage
source: Select a language and the preferred date format
de: Stellen Sie die Sprache und gewünschte Datumsformat ein
es: Selecciona un idioma y el formato de fecha deseado
fa: یک زبان و قالب تاریخ را انتخاب کنید
fr: Sélectionnez une langue et le format de date préféré
tr: Bir dil ve tercih edilen tarih formatını seçin

# locationDescription
source: This app can use your location to calculate the sunset time. You can either let the app use your device location, set the location manually, or don't use locations. If you don't use location, 6pm will be used as sunset time. You can change the settings anytime.
de: Dieses App kann Ihr Standort verwenden um die Zeit des Sonnenuntergangs zu berechnen. Sie können entweder den Standort des Gerätes benutzten, Ihren Standort manuell einstellen, oder keinen Standort verwenden. Wenn sie keinen Standort verwenden, wird der Sonnenuntergang auf 18 Uhr geschätzt. Sie können die Einstellungen jederzeit ändern.
es: Esta aplicación puede calcular la hora de la puesta de sol a través de tu posición. Puedes usar la localización automática o configurarla manualmente o no utilizar ninguna localización. Si no usas tu posición, la puesta de sol se colocará a las 6 pm. Puedes cambiar tu configuración a tu gusto.
fa: این برنامه می تواند از مکان شما برای محاسبه زمان غروب آفتاب استفاده کند. می توانید به برنامه اجازه دهید از مکان دستگاه شما استفاده کند ، مکان را به صورت دستی تنظیم کند یا از مکان استفاده نکند. اگر از مکان استفاده نکنید ، ساعت 6 عصر به عنوان زمان غروب آفتاب استفاده می شود. در هر زمان می توانید تنظیمات را تغییر دهید
fr: This app can use your location to calculate the sunset time. You can either let the app use your device location, set the location manually, or don't use locations. If you don't use location, 6pm will be used as sunset time. You can change settings anytime.
tr: This app can use your location to calculate the sunset time. You can either let the app use your device location, set the location manually, or don't use locations. If you don't use location, 6pm will be used as sunset time. You can change settings anytime.

source: Select location method
de: Stellen sie die gewünschte Positionierungsmethode ein
es: Selecciona un método de localización
fa: روش مکان را انتخاب کنید
fr: Sélectionnez la méthode de localisation
tr: Konum yöntemini seçin

# darkModeTitle
source: Dark Mode
de: Dunklemodus
es: Modo nocturno<

# faAvailable
source: Persian is available again:
de: Persisch ist wieder verfügbar:
es: el idioma persa está disponible de nuevo:

# darkModeDescription
source: Dark mode is now used if it is set in your system settings.
de: Dunklemodus wird verwendet, wenn es in den Systemeinstellungen eingestellt ist.
es: El modo nocturno se activa si está activo en tu configuración del teléfono.

# hideSunsetTimesTitle
source: Start of the day
de: Start des Tages
es: Inicio del día

# hideSunsetTimesDescription
source: A day in the Badi calendar starts at sunset. If you like to omit sunset times for a simplified display, check the following checkbox.
de: Der Tag startet im Badí-Kalender mit dem Sonnenuntergang. Wenn die Sonnenuntergangszeiten für eine vereinfachte Anzeige entfernt werden sollen, aktivieren Sie die folgende Checkbox.
es: En el calendario Badí el día comienza con la puesta de sol. Si prefieres mostrar el inicio del día a a la medianoche, escoge la siguiente opción.

# ayyamiha
source: Ayyám-i-Há
es: Días de Há
fa: ايام الهاء
tr: Ha Günleri

# showOriginal
source: true
fa: false

source: OK
fa: خوب
fr: D'ACCORD
tr: iyi
